In [1]:
#p2_Introductory_example_051.ipynb
#Applying Operations Over pandas Dataframes, apply()

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
#Create a dataframe
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy','Jack','Smith'], 
        'year': [2012, 2012, 2013, 2014, 2014,2016,2016], 
        'reports': [4, 24, 31, 2, 3,44,12],
        'coverage': [25, 94, 57, 62, 70,98,45]}
df = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma','A1','B1'])
df

            coverage   name  reports  year
Cochice           25  Jason        4  2012
Pima              94  Molly       24  2012
Santa Cruz        57   Tina       31  2013
Maricopa          62   Jake        2  2014
Yuma              70    Amy        3  2014
A1                98   Jack       44  2016
B1                45  Smith       12  2016

In [5]:
#Create a capitalization lambda function
capitalizer = lambda x: x.upper()

In [6]:
#Apply the capitalizer function over the column 'name'
df['name'].apply(capitalizer)

Cochice       JASON
Pima          MOLLY
Santa Cruz     TINA
Maricopa       JAKE
Yuma            AMY
A1             JACK
B1            SMITH
Name: name, dtype: object

In [7]:
#Map the capitalizer lambda function over each element in the series 'name'
df['name'].map(capitalizer)

Cochice       JASON
Pima          MOLLY
Santa Cruz     TINA
Maricopa       JAKE
Yuma            AMY
A1             JACK
B1            SMITH
Name: name, dtype: object

In [8]:
df #DataFrame df

            coverage   name  reports  year
Cochice           25  Jason        4  2012
Pima              94  Molly       24  2012
Santa Cruz        57   Tina       31  2013
Maricopa          62   Jake        2  2014
Yuma              70    Amy        3  2014
A1                98   Jack       44  2016
B1                45  Smith       12  2016

In [9]:
#SQL --> select sum(reports) from df group by year
df.groupby('year').reports.sum()

year
2012    28
2013    31
2014     5
2016    56
Name: reports, dtype: int64

In [10]:
#定義一個 add_percent() function
def add_percent(d):
    #Integer division floors
    reports=d.reports.astype(float)
    
    d['percent']=d.reports/d.reports.sum() #新增percent欄位,填值為 reports/reports.sum()
    return d #回傳新增percent欄位並已填值的 DataFrame d

In [11]:
df2=pd.DataFrame([df['reports'],df['year']]).T 
                              #從DataFrame df 切一個 column 'reports','year'
                              #使用df.DataFrame() 產生一個 DataFrame df2

In [12]:
df2 #DataFrame df2

            reports  year
Cochice           4  2012
Pima             24  2012
Santa Cruz       31  2013
Maricopa          2  2014
Yuma              3  2014
A1               44  2016
B1               12  2016

In [13]:
df2.groupby('year').reports.sum()

year
2012    28
2013    31
2014     5
2016    56
Name: reports, dtype: int64

In [14]:
df2.groupby('year').apply(add_percent)

            reports  year   percent
Cochice           4  2012  0.142857
Pima             24  2012  0.857143
Santa Cruz       31  2013  1.000000
Maricopa          2  2014  0.400000
Yuma              3  2014  0.600000
A1               44  2016  0.785714
B1               12  2016  0.214286